[Killed] BlockStatement
src/Cell.ts:7:18
   protected static aliveType = Symbol()
   protected static deadType = Symbol()
 
-  static alive() {
-    return new AliveCell()
-  }
+  static alive() {}
 
   static dead() {
killedBy: Cell can be created alive
statusReason: Cannot read properties of undefined (reading 'isAlive')

[Killed] BlockStatement
src/Cell.ts:31:55
 class AliveCell extends Cell {
   private readonly type = Cell.aliveType
 
-  override nextGeneration(neighbors: Neighbors): Cell {
-    if (neighbors.hasUnderpopulation()) return Cell.dead()
-
-    if (neighbors.isOvercrowded()) return Cell.dead()
-
-    return this
-  }
+  override nextGeneration(neighbors: Neighbors): Cell {}
 
   override isAlive(): boolean {
killedBy: Cell when is alive dies with 0 neighbors because of under-population
statusReason: Cannot read properties of undefined (reading 'isDead')

[Killed] BlockStatement
src/Cell.ts:55:55
 class DeadCell extends Cell {
   private readonly type = Cell.deadType
 
-  override nextGeneration(neighbors: Neighbors): Cell {
-    if (neighbors.hasThreeAlive()) return Cell.alive()
-
-    return this
-  }
+  override nextGeneration(neighbors: Neighbors): Cell {}
 
   override isAlive(): boolean {
killedBy: Cell when is dead revives with exactly 3 neighbors
statusReason: Cannot read properties of undefined (reading 'isAlive')
