[Killed] BlockStatement
src/GameOfLife.ts:7:42
 export class GameOfLife {
   private board: Board
 
-  public constructor(board: boolean[][]) {
-    this.board = new Board(board.map((row) => row.map((isAlive) => Cell.create(isAlive))))
-  }
+  public constructor(board: boolean[][]) {}
 
   public nextGen(): void {
killedBy: GameOfLife runs an iteration on a simple board
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/GameOfLife.ts:8:38
   private board: Board
 
   public constructor(board: boolean[][]) {
-    this.board = new Board(board.map((row) => row.map((isAlive) => Cell.create(isAlive))))
+    this.board = new Board(board.map(() => undefined))
   }
 
killedBy: GameOfLife runs an iteration on a simple board
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/GameOfLife.ts:8:55
   private board: Board
 
   public constructor(board: boolean[][]) {
-    this.board = new Board(board.map((row) => row.map((isAlive) => Cell.create(isAlive))))
+    this.board = new Board(board.map((row) => row.map(() => undefined)))
   }
 
killedBy: GameOfLife runs an iteration on a simple board
statusReason: Cannot read properties of undefined (reading 'nextGeneration')

[Survived] BlockStatement
src/GameOfLife.ts:11:26
     this.board = new Board(board.map((row) => row.map((isAlive) => Cell.create(isAlive))))
   }
 
-  public nextGen(): void {
-    this.board = this.board.map((cell, neighbors) => cell.nextGeneration(neighbors))
-  }
+  public nextGen(): void {}
 
   public toString() {

[Killed] ArrowFunction
src/GameOfLife.ts:12:33
   }
 
   public nextGen(): void {
-    this.board = this.board.map((cell, neighbors) => cell.nextGeneration(neighbors))
+    this.board = this.board.map(() => undefined)
   }
 
killedBy: GameOfLife runs an iteration on a simple board
statusReason: expected GameOfLife{ board: Board{ …(1) } } to deeply equal GameOfLife{ board: Board{ …(1) } }

[NoCoverage] BlockStatement
src/GameOfLife.ts:15:21
     this.board = this.board.map((cell, neighbors) => cell.nextGeneration(neighbors))
   }
 
-  public toString() {
-    return this.board.toString()
-  }
+  public toString() {}
 }
 
