[NoCoverage] ArrayDeclaration
src/main.ts:4:15
 import { setTimeout } from "timers/promises"
 import { GameOfLife } from "./GameOfLife.js"
 
-const board = [
-  [false, false, false, false, false, false, false, false, false, false],
-  [false, false, false, false, false, false, false, false, false, false],
-  [false, false, false, false, false, false, false, false, false, false],
-  [false, false, false, false, false, false, false, false, false, false],
-  [false, false, false, false, true, false, false, false, false, false],
-  [false, false, false, true, true, true, false, false, false, false],
-  [false, false, false, false, false, false, false, false, false, false],
-  [false, false, false, false, false, false, false, false, false, false],
-  [false, false, false, false, false, false, false, false, false, false],
-  [false, false, false, false, false, false, false, false, false, false],
-]
+const board = []
 
 const gameOfLife = new GameOfLife(board)

[NoCoverage] BooleanLiteral
src/main.ts:5:46
 import { GameOfLife } from "./GameOfLife.js"
 
 const board = [
-  [false, false, false, false, false, false, false, false, false, false],
+  [false, false, false, false, false, false, true, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],

[NoCoverage] BooleanLiteral
src/main.ts:5:4
 import { GameOfLife } from "./GameOfLife.js"
 
 const board = [
-  [false, false, false, false, false, false, false, false, false, false],
+  [true, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],

[NoCoverage] BooleanLiteral
src/main.ts:6:25
 
 const board = [
   [false, false, false, false, false, false, false, false, false, false],
-  [false, false, false, false, false, false, false, false, false, false],
+  [false, false, false, true, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],

[NoCoverage] BooleanLiteral
src/main.ts:6:11
 
 const board = [
   [false, false, false, false, false, false, false, false, false, false],
-  [false, false, false, false, false, false, false, false, false, false],
+  [false, true, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],

[NoCoverage] BooleanLiteral
src/main.ts:7:67
 const board = [
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
-  [false, false, false, false, false, false, false, false, false, false],
+  [false, false, false, false, false, false, false, false, false, true],
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, true, false, false, false, false, false],

[NoCoverage] BooleanLiteral
src/main.ts:7:46
 const board = [
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
-  [false, false, false, false, false, false, false, false, false, false],
+  [false, false, false, false, false, false, true, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, true, false, false, false, false, false],

[NoCoverage] BooleanLiteral
src/main.ts:8:18
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
-  [false, false, false, false, false, false, false, false, false, false],
+  [false, false, true, false, false, false, false, false, false, false],
   [false, false, false, false, true, false, false, false, false, false],
   [false, false, false, true, true, true, false, false, false, false],

[NoCoverage] BooleanLiteral
src/main.ts:8:4
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
-  [false, false, false, false, false, false, false, false, false, false],
+  [true, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, true, false, false, false, false, false],
   [false, false, false, true, true, true, false, false, false, false],

[NoCoverage] BooleanLiteral
src/main.ts:9:52
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
-  [false, false, false, false, true, false, false, false, false, false],
+  [false, false, false, false, true, false, false, true, false, false],
   [false, false, false, true, true, true, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],

[NoCoverage] BooleanLiteral
src/main.ts:9:66
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
-  [false, false, false, false, true, false, false, false, false, false],
+  [false, false, false, false, true, false, false, false, false, true],
   [false, false, false, true, true, true, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],

[NoCoverage] BooleanLiteral
src/main.ts:10:31
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, true, false, false, false, false, false],
-  [false, false, false, true, true, true, false, false, false, false],
+  [false, false, false, true, false, true, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],

[NoCoverage] BooleanLiteral
src/main.ts:10:43
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, true, false, false, false, false, false],
-  [false, false, false, true, true, true, false, false, false, false],
+  [false, false, false, true, true, true, true, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],

[NoCoverage] BooleanLiteral
src/main.ts:11:53
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, true, false, false, false, false, false],
   [false, false, false, true, true, true, false, false, false, false],
-  [false, false, false, false, false, false, false, false, false, false],
+  [false, false, false, false, false, false, false, true, false, false],
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],

[NoCoverage] BooleanLiteral
src/main.ts:11:18
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, true, false, false, false, false, false],
   [false, false, false, true, true, true, false, false, false, false],
-  [false, false, false, false, false, false, false, false, false, false],
+  [false, false, true, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],

[NoCoverage] BooleanLiteral
src/main.ts:12:39
   [false, false, false, false, true, false, false, false, false, false],
   [false, false, false, true, true, true, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
-  [false, false, false, false, false, false, false, false, false, false],
+  [false, false, false, false, false, true, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],

[NoCoverage] BooleanLiteral
src/main.ts:14:53
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
   [false, false, false, false, false, false, false, false, false, false],
-  [false, false, false, false, false, false, false, false, false, false],
+  [false, false, false, false, false, false, false, true, false, false],
 ]
 
