[Killed] BlockStatement
src/Board.ts:8:39
 export class Board {
   private readonly cells: Cell[][]
 
-  public constructor(cells: Cell[][]) {
-    this.cells = cells
-  }
+  public constructor(cells: Cell[][]) {}
 
   map(callback: (cell: Cell, neighbors: Neighbors) => Cell): Board {
killedBy: Board map changes to a dead cell
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/Board.ts:12:68
     this.cells = cells
   }
 
-  map(callback: (cell: Cell, neighbors: Neighbors) => Cell): Board {
-    const cells = this.cells.map((r, row) =>
-      r.map((cell, column) => callback(cell, this.getNeighbors(Coordinates.at(row, column)))),
-    )
-    return new Board(cells)
-  }
+  map(callback: (cell: Cell, neighbors: Neighbors) => Cell): Board {}
 
   getNeighbors(coordinates: Coordinates) {
killedBy: Board map changes to a dead cell
statusReason: expected undefined to deeply equal Board{ cells: [ [ DeadCell{} ] ] }

[Killed] ArrowFunction
src/Board.ts:13:34
   }
 
   map(callback: (cell: Cell, neighbors: Neighbors) => Cell): Board {
-    const cells = this.cells.map((r, row) =>
-      r.map((cell, column) => callback(cell, this.getNeighbors(Coordinates.at(row, column)))),
+    const cells = this.cells.map(() => undefined,
     )
     return new Board(cells)
killedBy: Board map changes to a dead cell
statusReason: expected Board{ cells: [ undefined ] } to deeply equal Board{ cells: [ [ DeadCell{} ] ] }

[Killed] ArrowFunction
src/Board.ts:14:13
 
   map(callback: (cell: Cell, neighbors: Neighbors) => Cell): Board {
     const cells = this.cells.map((r, row) =>
-      r.map((cell, column) => callback(cell, this.getNeighbors(Coordinates.at(row, column)))),
+      r.map(() => undefined),
     )
     return new Board(cells)
killedBy: Board map changes to a dead cell
statusReason: expected Board{ cells: [ [ undefined ] ] } to deeply equal Board{ cells: [ [ DeadCell{} ] ] }

[Killed] BlockStatement
src/Board.ts:19:42
     return new Board(cells)
   }
 
-  getNeighbors(coordinates: Coordinates) {
-    const cells = coordinates.getNeighbors().map((coordinates) => coordinates.getFrom(this.cells))
-
-    return new Neighbors(cells)
-  }
+  getNeighbors(coordinates: Coordinates) {}
 
   toString(): string {
killedBy: Board map sends the neighbors to the callback
statusReason: expected "spy" to be called with arguments: [ Neighbors{ cells: [ …(8) ] } ]

Received: 

  1st spy call:

  Array [
-   Neighbors {

[Killed] ArrowFunction
src/Board.ts:20:50
   }
 
   getNeighbors(coordinates: Coordinates) {
-    const cells = coordinates.getNeighbors().map((coordinates) => coordinates.getFrom(this.cells))
+    const cells = coordinates.getNeighbors().map(() => undefined)
 
     return new Neighbors(cells)
killedBy: Board map sends the neighbors to the callback
statusReason: expected "spy" to be called with arguments: [ Neighbors{ cells: [ …(8) ] } ]

Received: 

  1st spy call:

  Array [
    Neighbors {

[Killed] BlockStatement
src/Board.ts:25:22
     return new Neighbors(cells)
   }
 
-  toString(): string {
-    return this.cells.map((row) => row.join("")).join("\n")
-  }
+  toString(): string {}
 }
 
killedBy: Board getNeighbors can be transformed to string
statusReason: expected undefined to be ' ◼◼\n◼ ◼\n◼◼ ' // Object.is equality

[Killed] ArrowFunction
src/Board.ts:26:27
   }
 
   toString(): string {
-    return this.cells.map((row) => row.join("")).join("\n")
+    return this.cells.map(() => undefined).join("\n")
   }
 }
killedBy: Board getNeighbors can be transformed to string
statusReason: expected '\n\n' to be ' ◼◼\n◼ ◼\n◼◼ ' // Object.is equality

[Killed] StringLiteral
src/Board.ts:26:45
   }
 
   toString(): string {
-    return this.cells.map((row) => row.join("")).join("\n")
+    return this.cells.map((row) => row.join("Stryker was here!")).join("\n")
   }
 }
killedBy: Board getNeighbors can be transformed to string
statusReason: expected ' Stryker was here!◼Stryker was here!◼…' to be ' ◼◼\n◼ ◼\n◼◼ ' // Object.is equality
