[Killed] BlockStatement
src/Cell.ts:4:18
 import { Neighbors } from "./Neighbors.js"
 
 export abstract class Cell {
-  static alive() {
-    return new AliveCell()
-  }
+  static alive() {}
 
   static dead() {
killedBy: Neighbors counts the amount of dead cells
statusReason: Cannot read properties of undefined (reading 'isDead')

[Killed] BlockStatement
src/Cell.ts:8:17
     return new AliveCell()
   }
 
-  static dead() {
-    return new DeadCell()
-  }
+  static dead() {}
 
   static create(isAlive: boolean): Cell {
killedBy: Cell can be created dead
statusReason: Cannot read properties of undefined (reading 'isAlive')

[Killed] BlockStatement
src/Cell.ts:12:41
     return new DeadCell()
   }
 
-  static create(isAlive: boolean): Cell {
-    return isAlive ? this.alive() : this.dead()
-  }
+  static create(isAlive: boolean): Cell {}
 
   abstract isAlive(): boolean
killedBy: GameOfLife runs an iteration on a simple board
statusReason: Cannot read properties of undefined (reading 'nextGeneration')

[Killed] BlockStatement
src/Cell.ts:26:55
 }
 
 class AliveCell extends Cell {
-  override nextGeneration(neighbors: Neighbors): Cell {
-    if (neighbors.hasUnderpopulation()) return Cell.dead()
-
-    if (neighbors.isOvercrowded()) return Cell.dead()
-
-    return this
-  }
+  override nextGeneration(neighbors: Neighbors): Cell {}
 
   override isAlive(): boolean {
killedBy: Cell when is alive dies with 0 neighbors because of under-population
statusReason: Cannot read properties of undefined (reading 'isDead')

[Killed] ConditionalExpression
src/Cell.ts:27:9
 
 class AliveCell extends Cell {
   override nextGeneration(neighbors: Neighbors): Cell {
-    if (neighbors.hasUnderpopulation()) return Cell.dead()
+    if (true) return Cell.dead()
 
     if (neighbors.isOvercrowded()) return Cell.dead()
killedBy: Cell when is alive remains alive with 2 neighbors
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/Cell.ts:27:9
 
 class AliveCell extends Cell {
   override nextGeneration(neighbors: Neighbors): Cell {
-    if (neighbors.hasUnderpopulation()) return Cell.dead()
+    if (false) return Cell.dead()
 
     if (neighbors.isOvercrowded()) return Cell.dead()
killedBy: Cell when is alive dies with 0 neighbors because of under-population
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/Cell.ts:29:9
   override nextGeneration(neighbors: Neighbors): Cell {
     if (neighbors.hasUnderpopulation()) return Cell.dead()
 
-    if (neighbors.isOvercrowded()) return Cell.dead()
+    if (false) return Cell.dead()
 
     return this
killedBy: Cell when is alive dies with 4 neighbors because of overcrowding
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/Cell.ts:29:9
   override nextGeneration(neighbors: Neighbors): Cell {
     if (neighbors.hasUnderpopulation()) return Cell.dead()
 
-    if (neighbors.isOvercrowded()) return Cell.dead()
+    if (true) return Cell.dead()
 
     return this
killedBy: Cell when is alive remains alive with 2 neighbors
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/Cell.ts:34:31
     return this
   }
 
-  override isAlive(): boolean {
-    return true
-  }
+  override isAlive(): boolean {}
 
   override isDead(): boolean {
killedBy: Cell can be created alive
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/Cell.ts:35:12
   }
 
   override isAlive(): boolean {
-    return true
+    return false
   }
 
killedBy: Cell can be created alive
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/Cell.ts:38:30
     return true
   }
 
-  override isDead(): boolean {
-    return false
-  }
+  override isDead(): boolean {}
 
   override toString(): string {

[Killed] BooleanLiteral
src/Cell.ts:39:12
   }
 
   override isDead(): boolean {
-    return false
+    return true
   }
 
killedBy: Board getNeighbors retrieves dead cells if overflows the board on negative index
statusReason: expected 8 to be 5 // Object.is equality

[Killed] BlockStatement
src/Cell.ts:42:31
     return false
   }
 
-  override toString(): string {
-    return "◼"
-  }
+  override toString(): string {}
 }
 
killedBy: Board getNeighbors can be transformed to string
statusReason: expected ' undefinedundefined\nundefined undefi…' to be ' ◼◼\n◼ ◼\n◼◼ ' // Object.is equality

[Killed] BlockStatement
src/Cell.ts:48:55
 }
 
 class DeadCell extends Cell {
-  override nextGeneration(neighbors: Neighbors): Cell {
-    if (neighbors.hasThreeAlive()) return Cell.alive()
-
-    return this
-  }
+  override nextGeneration(neighbors: Neighbors): Cell {}
 
   override isAlive(): boolean {
killedBy: Cell when is dead revives with exactly 3 neighbors
statusReason: Cannot read properties of undefined (reading 'isAlive')

[Killed] ConditionalExpression
src/Cell.ts:49:9
 
 class DeadCell extends Cell {
   override nextGeneration(neighbors: Neighbors): Cell {
-    if (neighbors.hasThreeAlive()) return Cell.alive()
+    if (true) return Cell.alive()
 
     return this
killedBy: Cell when is dead remains dead with 2 neighbors
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/Cell.ts:49:9
 
 class DeadCell extends Cell {
   override nextGeneration(neighbors: Neighbors): Cell {
-    if (neighbors.hasThreeAlive()) return Cell.alive()
+    if (false) return Cell.alive()
 
     return this
killedBy: Cell when is dead revives with exactly 3 neighbors
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/Cell.ts:54:31
     return this
   }
 
-  override isAlive(): boolean {
-    return false
-  }
+  override isAlive(): boolean {}
 
   override isDead(): boolean {
killedBy: Cell can be created dead
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/Cell.ts:55:12
   }
 
   override isAlive(): boolean {
-    return false
+    return true
   }
 
killedBy: Cell can be created dead
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/Cell.ts:58:30
     return false
   }
 
-  override isDead(): boolean {
-    return true
-  }
+  override isDead(): boolean {}
 
   override toString(): string {
killedBy: Board getNeighbors retrieves dead cells if overflows the board on negative index
statusReason: expected +0 to be 5 // Object.is equality

[Killed] BooleanLiteral
src/Cell.ts:59:12
   }
 
   override isDead(): boolean {
-    return true
+    return false
   }
 
killedBy: Board getNeighbors retrieves dead cells if overflows the board on negative index
statusReason: expected +0 to be 5 // Object.is equality

[Killed] BlockStatement
src/Cell.ts:62:31
     return true
   }
 
-  override toString(): string {
-    return " "
-  }
+  override toString(): string {}
 }
 
killedBy: Board getNeighbors can be transformed to string
statusReason: expected 'undefined◼◼\n◼undefined◼\n◼◼undefined' to be ' ◼◼\n◼ ◼\n◼◼ ' // Object.is equality
