[Killed] BlockStatement
src/Coordinates.ts:4:62
 import { Cell } from "./Cell.js"
 
 export class Coordinates {
-  public static at(row: number, column: number): Coordinates {
-    return new Coordinates(row, column)
-  }
+  public static at(row: number, column: number): Coordinates {}
 
   constructor(
killedBy: Board map changes to a dead cell
statusReason: Cannot read properties of undefined (reading 'getNeighbors')

[Killed] BlockStatement
src/Coordinates.ts:13:38
     private readonly column: number,
   ) {}
 
-  getNeighbors(): Array<Coordinates> {
-    return this.getSurrounding().filter(Coordinates.notEquals(this))
-  }
+  getNeighbors(): Array<Coordinates> {}
 
   private getSurrounding() {
killedBy: Board map changes to a dead cell
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] MethodExpression
src/Coordinates.ts:14:12
   ) {}
 
   getNeighbors(): Array<Coordinates> {
-    return this.getSurrounding().filter(Coordinates.notEquals(this))
+    return this.getSurrounding()
   }
 
killedBy: Board map changes to a dead cell
statusReason: There bust be 8 neighbors

[Killed] BlockStatement
src/Coordinates.ts:17:28
     return this.getSurrounding().filter(Coordinates.notEquals(this))
   }
 
-  private getSurrounding() {
-    const coordinates: Array<Coordinates> = []
-    for (let row = this.row - 1; row <= this.row + 1; row++) {
-      for (let column = this.column - 1; column <= this.column + 1; column++) {
-        coordinates.push(Coordinates.at(row, column))
-      }
-    }
-    return coordinates
-  }
+  private getSurrounding() {}
 
   getFrom(board: Cell[][]) {
killedBy: Board map changes to a dead cell
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] EqualityOperator
src/Coordinates.ts:19:34
 
   private getSurrounding() {
     const coordinates: Array<Coordinates> = []
-    for (let row = this.row - 1; row <= this.row + 1; row++) {
+    for (let row = this.row - 1; row < this.row + 1; row++) {
       for (let column = this.column - 1; column <= this.column + 1; column++) {
         coordinates.push(Coordinates.at(row, column))
killedBy: Board map changes to a dead cell
statusReason: There bust be 8 neighbors

[Killed] ArithmeticOperator
src/Coordinates.ts:19:20
 
   private getSurrounding() {
     const coordinates: Array<Coordinates> = []
-    for (let row = this.row - 1; row <= this.row + 1; row++) {
+    for (let row = this.row + 1; row <= this.row + 1; row++) {
       for (let column = this.column - 1; column <= this.column + 1; column++) {
         coordinates.push(Coordinates.at(row, column))
killedBy: Board map changes to a dead cell
statusReason: There bust be 8 neighbors

[Killed] ArithmeticOperator
src/Coordinates.ts:20:52
   private getSurrounding() {
     const coordinates: Array<Coordinates> = []
     for (let row = this.row - 1; row <= this.row + 1; row++) {
-      for (let column = this.column - 1; column <= this.column + 1; column++) {
+      for (let column = this.column - 1; column <= this.column - 1; column++) {
         coordinates.push(Coordinates.at(row, column))
       }
killedBy: Board map changes to a dead cell
statusReason: There bust be 8 neighbors

[Killed] ConditionalExpression
src/Coordinates.ts:20:42
   private getSurrounding() {
     const coordinates: Array<Coordinates> = []
     for (let row = this.row - 1; row <= this.row + 1; row++) {
-      for (let column = this.column - 1; column <= this.column + 1; column++) {
+      for (let column = this.column - 1; false; column++) {
         coordinates.push(Coordinates.at(row, column))
       }
killedBy: Board map changes to a dead cell
statusReason: There bust be 8 neighbors

[Killed] BlockStatement
src/Coordinates.ts:27:28
     return coordinates
   }
 
-  getFrom(board: Cell[][]) {
-    if (this.row < 0 || this.column < 0) {
-      return Cell.dead()
-    }
-
-    if (this.row >= board.length || this.column >= board.length) {
-      return Cell.dead()
-    }
-
-    return board[this.row][this.column]
-  }
+  getFrom(board: Cell[][]) {}
 
   private equals(other: Coordinates) {
killedBy: Board map sends the neighbors to the callback
statusReason: expected "spy" to be called with arguments: [ Neighbors{ cells: [ …(8) ] } ]

Received: 

  1st spy call:

  Array [
    Neighbors {

[Killed] EqualityOperator
src/Coordinates.ts:28:9
   }
 
   getFrom(board: Cell[][]) {
-    if (this.row < 0 || this.column < 0) {
+    if (this.row >= 0 || this.column < 0) {
       return Cell.dead()
     }
killedBy: Board map changes to a dead cell
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/Coordinates.ts:28:9
   }
 
   getFrom(board: Cell[][]) {
-    if (this.row < 0 || this.column < 0) {
+    if (true) {
       return Cell.dead()
     }
killedBy: Board getNeighbors retrieves dead cells if overflows the board on negative index
statusReason: expected 8 to be 5 // Object.is equality

[Killed] ConditionalExpression
src/Coordinates.ts:32:37
       return Cell.dead()
     }
 
-    if (this.row >= board.length || this.column >= board.length) {
+    if (this.row >= board.length || false) {
       return Cell.dead()
     }
killedBy: Board map sends the neighbors to the callback
statusReason: expected "spy" to be called with arguments: [ Neighbors{ cells: [ …(8) ] } ]

Received: 

  1st spy call:

  Array [
    Neighbors {

[Killed] LogicalOperator
src/Coordinates.ts:32:9
       return Cell.dead()
     }
 
-    if (this.row >= board.length || this.column >= board.length) {
+    if (this.row >= board.length && this.column >= board.length) {
       return Cell.dead()
     }
killedBy: Board map changes to a dead cell
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/Coordinates.ts:39:38
     return board[this.row][this.column]
   }
 
-  private equals(other: Coordinates) {
-    return this.row === other.row && this.column === other.column
-  }
+  private equals(other: Coordinates) {}
 
   private static notEquals = (a: Coordinates) => (b: Coordinates) => !a.equals(b)
killedBy: Board map changes to a dead cell
statusReason: There bust be 8 neighbors

[Killed] ConditionalExpression
src/Coordinates.ts:40:12
   }
 
   private equals(other: Coordinates) {
-    return this.row === other.row && this.column === other.column
+    return false
   }
 
killedBy: Board map changes to a dead cell
statusReason: There bust be 8 neighbors

[Killed] ConditionalExpression
src/Coordinates.ts:40:38
   }
 
   private equals(other: Coordinates) {
-    return this.row === other.row && this.column === other.column
+    return this.row === other.row && true
   }
 
killedBy: Board map changes to a dead cell
statusReason: There bust be 8 neighbors

[Killed] ArrowFunction
src/Coordinates.ts:43:50
     return this.row === other.row && this.column === other.column
   }
 
-  private static notEquals = (a: Coordinates) => (b: Coordinates) => !a.equals(b)
+  private static notEquals = (a: Coordinates) => () => undefined
 }
 
killedBy: Board map changes to a dead cell
statusReason: There bust be 8 neighbors

[Killed] BooleanLiteral
src/Coordinates.ts:43:70
     return this.row === other.row && this.column === other.column
   }
 
-  private static notEquals = (a: Coordinates) => (b: Coordinates) => !a.equals(b)
+  private static notEquals = (a: Coordinates) => (b: Coordinates) => a.equals(b)
 }
 
killedBy: Board map changes to a dead cell
statusReason: There bust be 8 neighbors
