[Killed] BlockStatement
src/Neighbors.ts:4:20
 import { Cell } from "./Cell.js"
 
 export class Neighbors {
-  static allDead() {
-    return new Neighbors([
-      Cell.dead(),
-      Cell.dead(),
-      Cell.dead(),
-      Cell.dead(),
-      Cell.dead(),
-      Cell.dead(),
-      Cell.dead(),
-      Cell.dead(),
-    ])
-  }
+  static allDead() {}
 
   static allAlive() {
killedBy: Board map sends the neighbors to the callback
statusReason: expected "spy" to be called with arguments: [ undefined ]

Received: 

  1st spy call:

  Array [
-   undefined,

[Killed] ArrayDeclaration
src/Neighbors.ts:5:26
 
 export class Neighbors {
   static allDead() {
-    return new Neighbors([
-      Cell.dead(),
-      Cell.dead(),
-      Cell.dead(),
-      Cell.dead(),
-      Cell.dead(),
-      Cell.dead(),
-      Cell.dead(),
-      Cell.dead(),
-    ])
+    return new Neighbors([])
   }
 
killedBy: Board map sends the neighbors to the callback
statusReason: There bust be 8 neighbors

[Killed] BlockStatement
src/Neighbors.ts:17:21
     ])
   }
 
-  static allAlive() {
-    return new Neighbors([
-      Cell.alive(),
-      Cell.alive(),
-      Cell.alive(),
-      Cell.alive(),
-      Cell.alive(),
-      Cell.alive(),
-      Cell.alive(),
-      Cell.alive(),
-    ])
-  }
+  static allAlive() {}
 
   static withAliveAmount(number: number): Neighbors {
killedBy: Neighbors counts the amount of dead cells
statusReason: Cannot read properties of undefined (reading 'deadAmount')

[Killed] ArrayDeclaration
src/Neighbors.ts:18:26
   }
 
   static allAlive() {
-    return new Neighbors([
-      Cell.alive(),
-      Cell.alive(),
-      Cell.alive(),
-      Cell.alive(),
-      Cell.alive(),
-      Cell.alive(),
-      Cell.alive(),
-      Cell.alive(),
-    ])
+    return new Neighbors([])
   }
 
killedBy: Neighbors counts the amount of dead cells
statusReason: There bust be 8 neighbors

[Killed] BlockStatement
src/Neighbors.ts:30:53
     ])
   }
 
-  static withAliveAmount(number: number): Neighbors {
-    const cells = new Array(8).fill(0).map((_, i) => (i < number ? Cell.alive() : Cell.dead()))
-    return new Neighbors(cells)
-  }
+  static withAliveAmount(number: number): Neighbors {}
 
   constructor(private readonly cells: Cell[]) {
killedBy: Cell when is alive dies with 1 neighbors because of under-population
statusReason: Cannot read properties of undefined (reading 'hasUnderpopulation')

[Killed] EqualityOperator
src/Neighbors.ts:31:55
   }
 
   static withAliveAmount(number: number): Neighbors {
-    const cells = new Array(8).fill(0).map((_, i) => (i < number ? Cell.alive() : Cell.dead()))
+    const cells = new Array(8).fill(0).map((_, i) => (i <= number ? Cell.alive() : Cell.dead()))
     return new Neighbors(cells)
   }
killedBy: Cell when is alive dies with 1 neighbors because of under-population
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/Neighbors.ts:31:55
   }
 
   static withAliveAmount(number: number): Neighbors {
-    const cells = new Array(8).fill(0).map((_, i) => (i < number ? Cell.alive() : Cell.dead()))
+    const cells = new Array(8).fill(0).map((_, i) => (true ? Cell.alive() : Cell.dead()))
     return new Neighbors(cells)
   }
killedBy: Cell when is alive remains alive with 2 neighbors
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/Neighbors.ts:35:47
     return new Neighbors(cells)
   }
 
-  constructor(private readonly cells: Cell[]) {
-    if (cells.length !== 8) {
-      throw Error("There bust be 8 neighbors")
-    }
-  }
+  constructor(private readonly cells: Cell[]) {}
 
   deadAmount() {
killedBy: Neighbors throws a error if the number of neighbors is less than 8
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/Neighbors.ts:36:29
   }
 
   constructor(private readonly cells: Cell[]) {
-    if (cells.length !== 8) {
-      throw Error("There bust be 8 neighbors")
-    }
+    if (cells.length !== 8) {}
   }
 
killedBy: Neighbors throws a error if the number of neighbors is less than 8
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/Neighbors.ts:36:9
   }
 
   constructor(private readonly cells: Cell[]) {
-    if (cells.length !== 8) {
+    if (true) {
       throw Error("There bust be 8 neighbors")
     }
killedBy: Board map changes to a dead cell
statusReason: There bust be 8 neighbors

[Killed] BlockStatement
src/Neighbors.ts:41:16
     }
   }
 
-  deadAmount() {
-    return this.cells.filter((cell) => cell.isDead()).length
-  }
+  deadAmount() {}
 
   private aliveAmount() {
killedBy: Board getNeighbors retrieves dead cells if overflows the board on negative index
statusReason: expected undefined to be 5 // Object.is equality

[Killed] MethodExpression
src/Neighbors.ts:42:12
   }
 
   deadAmount() {
-    return this.cells.filter((cell) => cell.isDead()).length
+    return this.cells.length
   }
 
killedBy: Board getNeighbors retrieves dead cells if overflows the board on negative index
statusReason: expected 8 to be 5 // Object.is equality

[Killed] ArrowFunction
src/Neighbors.ts:42:30
   }
 
   deadAmount() {
-    return this.cells.filter((cell) => cell.isDead()).length
+    return this.cells.filter(() => undefined).length
   }
 
killedBy: Neighbors can be created with an alive amount
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/Neighbors.ts:45:25
     return this.cells.filter((cell) => cell.isDead()).length
   }
 
-  private aliveAmount() {
-    return 8 - this.deadAmount()
-  }
+  private aliveAmount() {}
 
   hasUnderpopulation() {
killedBy: Cell when is alive dies with 0 neighbors because of under-population
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/Neighbors.ts:46:12
   }
 
   private aliveAmount() {
-    return 8 - this.deadAmount()
+    return 8 + this.deadAmount()
   }
 
killedBy: Cell when is alive remains alive with 2 neighbors
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/Neighbors.ts:49:24
     return 8 - this.deadAmount()
   }
 
-  hasUnderpopulation() {
-    return this.aliveAmount() < 2
-  }
+  hasUnderpopulation() {}
 
   isOvercrowded() {
killedBy: Cell when is alive dies with 0 neighbors because of under-population
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/Neighbors.ts:50:12
   }
 
   hasUnderpopulation() {
-    return this.aliveAmount() < 2
+    return true
   }
 
killedBy: Cell when is alive remains alive with 2 neighbors
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/Neighbors.ts:50:12
   }
 
   hasUnderpopulation() {
-    return this.aliveAmount() < 2
+    return false
   }
 
killedBy: Cell when is alive dies with 0 neighbors because of under-population
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/Neighbors.ts:53:19
     return this.aliveAmount() < 2
   }
 
-  isOvercrowded() {
-    return this.aliveAmount() > 3
-  }
+  isOvercrowded() {}
 
   hasThreeAlive() {
killedBy: Cell when is alive dies with 4 neighbors because of overcrowding
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/Neighbors.ts:54:12
   }
 
   isOvercrowded() {
-    return this.aliveAmount() > 3
+    return true
   }
 
killedBy: Cell when is alive remains alive with 2 neighbors
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/Neighbors.ts:54:12
   }
 
   isOvercrowded() {
-    return this.aliveAmount() > 3
+    return this.aliveAmount() <= 3
   }
 
killedBy: Cell when is alive remains alive with 2 neighbors
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/Neighbors.ts:57:19
     return this.aliveAmount() > 3
   }
 
-  hasThreeAlive() {
-    return this.aliveAmount() === 3
-  }
+  hasThreeAlive() {}
 }
 
killedBy: Cell when is dead revives with exactly 3 neighbors
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/Neighbors.ts:58:12
   }
 
   hasThreeAlive() {
-    return this.aliveAmount() === 3
+    return false
   }
 }
killedBy: Cell when is dead revives with exactly 3 neighbors
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/Neighbors.ts:58:12
   }
 
   hasThreeAlive() {
-    return this.aliveAmount() === 3
+    return this.aliveAmount() !== 3
   }
 }
killedBy: Cell when is dead revives with exactly 3 neighbors
statusReason: expected false to be true // Object.is equality
